"""
Завдання 3: Користування інкапсуляцією та абстракцією у реальному коді

Розгляньте фрагмент коду з існуючого проекту або бібліотеки та ідентифікуйте в ньому використання інкапсуляції та абстракції. 
Поясніть, як вони застосовуються і як це допомагає поліпшити читабельність та підтримку коду.
"""

# Приклад коду
import requests

response = requests.get("https://api.example.com/data")
if response.status_code == 200:
    print("Успішний запит!")
    print("Дані:", response.json())
else:
    print("Помилка при виконанні запиту:", response.status_code)


# В даному випадку прихована реалізація роботи з HTTP і користувачеві надаються лише необхідні методи для роботи з ним, як от get/post/delete/put/patch...

# Абстракція - в даному випадку ми абстрагуємось від реалізації методів роботи запиту requests.get та просто використовуємо потрібні нам методи для роботи з запитами.

# Абстракція та інкапсуляція значно допомагають поліпшити читабельність та підтримку коду: якщо в нас буде 10_000 запитів таких, як вказано вище
# а логіка роботи з запитами зміниться, то програмісти внесуть правку лише в логіку бібліотеки requests (той код, що для нас прихований) і наш код не поламається.